# number = int(input("Enter number : "))
# print(f"Number : {number}")
# first = number // 10
# print(first)
# second = number % 10
# print(second)

# 7589
# 9857

# number = 7589
# a = number % 10
# print(a)
# number //= 10  # number = number / 10 (7589 // 10 => 758)
# b = number % 10
# number //= 10  # number = number / 10 (758 // 10 => 75)
# c = number % 10
# d = number // 10
# print(b)
# print(c)
# print(d)
# a *= 1000
# b *= 100
# c *= 10
# number = a + b + c + d
# print(f"Result :: {number}")

# print(chr(9556), end="")
# print(chr(9552)*50, end="")
# print(chr(9559))

# Завдання 1
# Користувач вводить з клавіатури грошову суму в гривнях і копійках (гривні і копійки
# вводяться в різні змінні). Сума може бути введена як правильно (наприклад 19 грн 90
# коп), так і неправильно (наприклад 22 грн 978 коп). Написати програму, яка,
# використовуючи тільки лінійний алгоритм, здійснить коригування введення грошової
# суми в правильну форму.
# Наприклад, якщо користувач ввів 11 грн 150 коп, програма має вивести на екран суму 12
# грн 50 коп.
# uah = int(input("Enter uah : "))
# kop = int(input("Enter kop : "))

# uah += kop // 100
# kop %= 100
# print(f"{uah}uah {kop}kop")


# Завдання 2
# Написати програму обчислення відстані між населеними пунктами. Нижче наведено
# рекомендований вигляд:
# Обчислення відстані між населеними пунктами.
# Введіть вихідні дані:
# Масштаб карти (кількість кілометрів в одному сантиметрі) -> 120
# Відстань між точками, які зображують населені пункти (см) -> 3.5
# Відстань між населеними пунктами 420 км.

# print("Введіть вихідні дані:")
# scale = int(input("Масштаб карти (кількість кілометрів в одному сантиметрі) -> "))
# distance = float(input("Відстань між точками, які зображують населені пункти (см) -> "))
# print(f"Відстань між населеними пунктами {scale * distance}")

# Завдання 3
# Користувач вводить з клавіатури час у секундах. Необхідно написати програму, яка
# переведе введені користувачем секунди в години, хвилини, секунди і виводить їх на
# екран.

# 7586
# sec = int(input("Enter seconds :: "))
# h = sec // 3600
# sec %= 3600 #sec = sec - (h * 3600)
# m = sec // 60
# sec %=60
# print(f"{h}:{m}:{sec}")

# Завдання 9

# Користувач вводить з клавіатури розмір одного файлу в гігабайтах і швидкість
# інтернет-з’єднання в бітах на секунду. Порахувати, за скільки годин, хвилин і секунд
# завантажується файл.

# size = int(input("Enter size file -> "))
# speed = int(input("Enter speed -> "))

# size = size * 1024 * 1024 * 1024 * 8
# sec = size // speed
# h = sec // 3600
# sec %= 3600 #sec = sec - (h * 3600)
# m = sec // 60
# sec %=60
# print(f"{h}:{m}:{sec}")

# Користувач вводить з клавіатури час у секундах, що минув з початку дня. Вивести на
# екран поточний час у годинах, хвилинах і секундах. Порахувати, скільки годин, хвилин і
# секунд залишилося до півночі.

sec = int(input("Enter seconds :: "))
all = 24 * 60 * 60
sec = all - sec
h = sec // 3600
sec %= 3600 #sec = sec - (h * 3600)
m = sec // 60
sec %=60
print(f"{h}:{m}:{sec}")